## Today Agenda

- pandas
     -> Series
     -> Data frames

In [1]:
import pandas as pd

In [2]:
pd.__version__

'1.1.3'

In [3]:
print(dir(pd))

['BooleanDtype', 'Categorical', 'CategoricalDtype', 'CategoricalIndex', 'DataFrame', 'DateOffset', 'DatetimeIndex', 'DatetimeTZDtype', 'ExcelFile', 'ExcelWriter', 'Float64Index', 'Grouper', 'HDFStore', 'Index', 'IndexSlice', 'Int16Dtype', 'Int32Dtype', 'Int64Dtype', 'Int64Index', 'Int8Dtype', 'Interval', 'IntervalDtype', 'IntervalIndex', 'MultiIndex', 'NA', 'NaT', 'NamedAgg', 'Period', 'PeriodDtype', 'PeriodIndex', 'RangeIndex', 'Series', 'SparseDtype', 'StringDtype', 'Timedelta', 'TimedeltaIndex', 'Timestamp', 'UInt16Dtype', 'UInt32Dtype', 'UInt64Dtype', 'UInt64Index', 'UInt8Dtype', '__builtins__', '__cached__', '__doc__', '__docformat__', '__file__', '__getattr__', '__git_version__', '__loader__', '__name__', '__package__', '__path__', '__spec__', '__version__', '_config', '_hashtable', '_is_numpy_dev', '_lib', '_libs', '_np_version_under1p16', '_np_version_under1p17', '_np_version_under1p18', '_testing', '_tslib', '_typing', '_version', 'api', 'array', 'arrays', 'bdate_range', 'compat', 'concat', 'core', 'crosstab', 'cut', 'date_range', 'describe_option', 'errors', 'eval', 'factorize', 'get_dummies', 'get_option', 'infer_freq', 'interval_range', 'io', 'isna', 'isnull', 'json_normalize', 'lreshape', 'melt', 'merge', 'merge_asof', 'merge_ordered', 'notna', 'notnull', 'offsets', 'option_context', 'options', 'pandas', 'period_range', 'pivot', 'pivot_table', 'plotting', 'qcut', 'read_clipboard', 'read_csv', 'read_excel', 'read_feather', 'read_fwf', 'read_gbq', 'read_hdf', 'read_html', 'read_json', 'read_orc', 'read_parquet', 'read_pickle', 'read_sas', 'read_spss', 'read_sql', 'read_sql_query', 'read_sql_table', 'read_stata', 'read_table', 'reset_option', 'set_eng_float_format', 'set_option', 'show_versions', 'test', 'testing', 'timedelta_range', 'to_datetime', 'to_numeric', 'to_pickle', 'to_timedelta', 'tseries', 'unique', 'util', 'value_counts', 'wide_to_long']

In [4]:
print(len(dir(pd)))

140

## pandas series

## Hands On

In [7]:
import pandas as pd 
import numpy as np

In [8]:
mydata=np.arange(30,100)
print (mydata)

[30 31 32 33 34 35 36 37 38 39 40 41 42 43 44 45 46 47 48 49 50 51 52 53
 54 55 56 57 58 59 60 61 62 63 64 65 66 67 68 69 70 71 72 73 74 75 76 77
 78 79 80 81 82 83 84 85 86 87 88 89 90 91 92 93 94 95 96 97 98 99]

In [9]:
mydata=np.arange(30,100,10)
print (mydata)

[30 40 50 60 70 80 90]

In [14]:
mypop_data=pd.Series(mydata)
print(mypop_data)

0    30
1    40
2    50
3    60
4    70
5    80
6    90
dtype: int32

In [16]:
mypop_data.name="population"
print(mypop_data.name)

population

In [15]:
mypop_data.dtype

dtype('int32')

In [19]:
mypop_data[4]

70

In [20]:
mypop_data[1:4]

1    40
2    50
3    60
Name: population, dtype: int32

In [21]:
mypop_data[1:7:2]

1    40
3    60
5    80
Name: population, dtype: int32

In [22]:
g7_pop = pd.Series([43.2,4.6,3.5,342,46.5,95.8,876.34])

In [23]:
g7_pop

0     43.20
1      4.60
2      3.50
3    342.00
4     46.50
5     95.80
6    876.34
dtype: float64

In [24]:
g7_pop.values

array([ 43.2 ,   4.6 ,   3.5 , 342.  ,  46.5 ,  95.8 , 876.34])

In [25]:
g7_pop.index

RangeIndex(start=0, stop=7, step=1)

In [27]:
mypop_data.index=['a','b','c','d','e','f','g']

In [28]:
mypop_data

a    30
b    40
c    50
d    60
e    70
f    80
g    90
Name: population, dtype: int32

In [32]:
g7_pop.index=['canada','france','german','italy','india','srilanka','usa']
g7_pop

canada       43.20
france        4.60
german        3.50
italy       342.00
india        46.50
srilanka     95.80
usa         876.34
dtype: float64

In [33]:
import pandas as pd
import numpy as np

In [36]:
r=pd.Series(np.array([1,2,3,4,5,6]))
r

0    1
1    2
2    3
3    4
4    5
5    6
dtype: int32

In [42]:
r = pd.Series(np.array([1,2,3,4,5,6]),index=(['a','b','c','d','e','f']))
r

a    1
b    2
c    3
d    4
e    5
f    6
dtype: int32

In [43]:
help(np)

IOPub data rate exceeded.
The notebook server will temporarily stop sending output
to the client in order to avoid crashing it.
To change this limit, set the config variable
`--NotebookApp.iopub_data_rate_limit`.

Current values:
NotebookApp.iopub_data_rate_limit=1000000.0 (bytes/sec)
NotebookApp.rate_limit_window=3.0 (secs)

In [46]:
r = pd.Series(np.array([1,2,3,4,5,6]),index=(['a','b','c','d','e','f']),name='roll no')
r

a    1
b    2
c    3
d    4
e    5
f    6
Name: roll no, dtype: int32

In [47]:
r = pd.Series(np.array([1,2,3,4,5,6]),index=(['a','b','c','d','e','f']),name='roll no',dtype='float')
r

a    1.0
b    2.0
c    3.0
d    4.0
e    5.0
f    6.0
Name: roll no, dtype: float64

In [48]:
d={'a1':99,'a2':32,'a3':67,'a4':95,'a5':78}
d.keys()

dict_keys(['a1', 'a2', 'a3', 'a4', 'a5'])

In [49]:
d={'a1':99,'a2':32,'a3':67,'a4':95,'a5':78}
d.values()

dict_values([99, 32, 67, 95, 78])

In [50]:
d={'a1':99,'a2':32,'a3':67,'a4':95,'a5':78}
d.items()

dict_items([('a1', 99), ('a2', 32), ('a3', 67), ('a4', 95), ('a5', 78)])

In [52]:
marks = pd.Series(d,name='S Marks')
print(marks)

a1    99
a2    32
a3    67
a4    95
a5    78
Name: S Marks, dtype: int64

In [53]:
marks['a1']

99

In [55]:
marks[['a1','a2']]

a1    99
a2    32
Name: S Marks, dtype: int64

In [56]:
marks['a1':'a4']

a1    99
a2    32
a3    67
a4    95
Name: S Marks, dtype: int64

In [57]:
# iloc - it defines index values
# iloc - it defines index positions
marks.iloc[0]

99

In [58]:
marks.loc['a4']

95

In [59]:
marks.iloc[0:5]

a1    99
a2    32
a3    67
a4    95
a5    78
Name: S Marks, dtype: int64

In [60]:
import random

In [61]:
random.randint(1,10)

2

In [62]:
b=pd.Series(np.array([9,7,6,5,4,3,8]),index=list('ABCDEFG'),name='grades')
b

A    9
B    7
C    6
D    5
E    4
F    3
G    8
Name: grades, dtype: int32

In [63]:
b>6

A     True
B     True
C    False
D    False
E    False
F    False
G     True
Name: grades, dtype: bool

In [64]:
b[b>6]

A    9
B    7
G    8
Name: grades, dtype: int32

In [65]:
b*10

A    90
B    70
C    60
D    50
E    40
F    30
G    80
Name: grades, dtype: int32

In [66]:
b.mean()

6.0

In [67]:
b['A':'C'].mean()

7.333333333333333

In [68]:
(9+7+6)/3

7.333333333333333

In [69]:
b['A']=10
b

A    10
B     7
C     6
D     5
E     4
F     3
G     8
Name: grades, dtype: int32

###  -  probably the most important data structure of pandas is the DataFrame .
### its a tabular structure tightly integrated with series

In [70]:
ms_marks={'sub1':[99,98,93,56,76,34,23,13,15,78],'sub2':[67,13,45,67,46,89,76,12,56,65],'sub3':[23,32,34,43,45,54,56,65,67,87]
         ,'sub4':[98,89,87,78,76,67,65,46,35,26]}

In [71]:
marks=pd.DataFrame(ms_marks,index=['panda','jack','spyder','alice','bob','shizzu','motu','patlu','tom','jerrry'])
marks

        sub1  sub2  sub3  sub4
panda     99    67    23    98
jack      98    13    32    89
spyder    93    45    34    87
alice     56    67    43    78
bob       76    46    45    76
shizzu    34    89    54    67
motu      23    76    56    65
patlu     13    12    65    46
tom       15    56    67    35
jerrry    78    65    87    26

In [72]:
marks.loc['panda'].sum()

287

In [73]:
marks.index

Index(['panda', 'jack', 'spyder', 'alice', 'bob', 'shizzu', 'motu', 'patlu',
       'tom', 'jerrry'],
      dtype='object')

In [74]:
marks.columns

Index(['sub1', 'sub2', 'sub3', 'sub4'], dtype='object')

In [75]:
marks.size

40

In [76]:
marks.shape

(10, 4)

In [77]:
marks.describe()

            sub1     sub2       sub3       sub4
count  10.000000  10.0000  10.000000  10.000000
mean   58.500000  53.6000  50.600000  66.700000
std    34.811397  25.2991  19.190275  24.027993
min    13.000000  12.0000  23.000000  26.000000
25%    25.750000  45.2500  36.250000  50.750000
50%    66.000000  60.5000  49.500000  71.500000
75%    89.250000  67.0000  62.750000  84.750000
max    99.000000  89.0000  87.000000  98.000000

In [78]:
marks['sub1']

panda     99
jack      98
spyder    93
alice     56
bob       76
shizzu    34
motu      23
patlu     13
tom       15
jerrry    78
Name: sub1, dtype: int64

In [80]:
marks[['sub1','sub2']]

        sub1  sub2
panda     99    67
jack      98    13
spyder    93    45
alice     56    67
bob       76    46
shizzu    34    89
motu      23    76
patlu     13    12
tom       15    56
jerrry    78    65

In [81]:
marks[['sub1','sub4']]

        sub1  sub4
panda     99    98
jack      98    89
spyder    93    87
alice     56    78
bob       76    76
shizzu    34    67
motu      23    65
patlu     13    46
tom       15    35
jerrry    78    26

In [83]:
marks[marks>70]

        sub1  sub2  sub3  sub4
panda   99.0   NaN   NaN  98.0
jack    98.0   NaN   NaN  89.0
spyder  93.0   NaN   NaN  87.0
alice    NaN   NaN   NaN  78.0
bob     76.0   NaN   NaN  76.0
shizzu   NaN  89.0   NaN   NaN
motu     NaN  76.0   NaN   NaN
patlu    NaN   NaN   NaN   NaN
tom      NaN   NaN   NaN   NaN
jerrry  78.0   NaN  87.0   NaN

In [85]:
marks>70

         sub1   sub2   sub3   sub4
panda    True  False  False   True
jack     True  False  False   True
spyder   True  False  False   True
alice   False  False  False   True
bob      True  False  False   True
shizzu  False   True  False  False
motu    False   True  False  False
patlu   False  False  False  False
tom     False  False  False  False
jerrry   True  False   True  False

In [92]:
marks.sub1['panda']

99

In [93]:
marks['sub5']=[1,2,3,4,5,6,7,8,9,0]

In [94]:
marks

        sub1  sub2  sub3  sub4  sub5
panda     99    67    23    98     1
jack      98    13    32    89     2
spyder    93    45    34    87     3
alice     56    67    43    78     4
bob       76    46    45    76     5
shizzu    34    89    54    67     6
motu      23    76    56    65     7
patlu     13    12    65    46     8
tom       15    56    67    35     9
jerrry    78    65    87    26     0

##  how to drop columns

In [95]:
marks.drop(columns='sub5')

        sub1  sub2  sub3  sub4
panda     99    67    23    98
jack      98    13    32    89
spyder    93    45    34    87
alice     56    67    43    78
bob       76    46    45    76
shizzu    34    89    54    67
motu      23    76    56    65
patlu     13    12    65    46
tom       15    56    67    35
jerrry    78    65    87    26

In [96]:
marks

        sub1  sub2  sub3  sub4  sub5
panda     99    67    23    98     1
jack      98    13    32    89     2
spyder    93    45    34    87     3
alice     56    67    43    78     4
bob       76    46    45    76     5
shizzu    34    89    54    67     6
motu      23    76    56    65     7
patlu     13    12    65    46     8
tom       15    56    67    35     9
jerrry    78    65    87    26     0

In [ ]:
marks.drop(columns='sub5',axis=1,inplace=True)

In [103]:
marks

        sub1  sub2  sub3  sub4
panda     99    67    23    98
jack      98    13    32    89
spyder    93    45    34    87
alice     56    67    43    78
bob       76    46    45    76
shizzu    34    89    54    67
motu      23    76    56    65
patlu     13    12    65    46
tom       15    56    67    35
jerrry    78    65    87    26

In [105]:
marks.drop('panda',inplace=True)

In [106]:
marks

        sub1  sub2  sub3  sub4
jack      98    13    32    89
spyder    93    45    34    87
alice     56    67    43    78
bob       76    46    45    76
shizzu    34    89    54    67
motu      23    76    56    65
patlu     13    12    65    46
tom       15    56    67    35
jerrry    78    65    87    26

In [120]:
marks.iloc[:][3]=90
marks

        sub1  sub2  sub3  sub4
jack     100   100   100   100
spyder   100   100   100   100
alice    100   100   100   100
bob      100   100   100   100
shizzu   100   100   100   100
motu     100   100   100   100
patlu    100   100   100   100
tom      100   100   100   100
jerrry   100   100   100   100

In [119]:
marks

        sub1  sub2  sub3  sub4
jack     100   100   100   100
spyder   100   100   100   100
alice    100   100   100   100
bob      100   100   100   100
shizzu   100   100   100   100
motu     100   100   100   100
patlu    100   100   100   100
tom      100   100   100   100
jerrry   100   100   100   100

In [121]:
marks['sub4']=0

In [122]:
marks

        sub1  sub2  sub3  sub4
jack     100   100   100     0
spyder   100   100   100     0
alice    100   100   100     0
bob      100   100   100     0
shizzu   100   100   100     0
motu     100   100   100     0
patlu    100   100   100     0
tom      100   100   100     0
jerrry   100   100   100     0

In [134]:
import pandas as pd
pop_data=pd.read_csv('population.csv')
pop_data

ParserError: Error tokenizing data. C error: Expected 1 fields in line 11, saw 2

In [136]:
import pandas as pd
pop_data=pd.read_csv('papulation.csv')
pop_data

    2001  2002  2003  2004  2005  2006  2007  2008  2009  2010
0     91    92    93    94    95    96    97    98    89    54
1    120   125   130   135   140   145   150   155   160   165
2     91    92    93    94    95    96    97    98    89    54
3    120   125   130   135   140   145   150   155   160   165
4    120   125   130   135   140   145   150   155   160   165
5     91    92    93    94    95    96    97    98    89    54
6    120   125   130   135   140   145   150   155   160   165
7     91    92    93    94    95    96    97    98    89    54
8    120   125   130   135   140   145   150   155   160   165
9    120   125   130   135   140   145   150   155   160   165
10    91    92    93    94    95    96    97    98    89    54
11   120   125   130   135   140   145   150   155   160   165

In [139]:
pop_data.index=['india','America','Rashya','Canada','italy','china','Africa','Afganisthan','Usa','Dubai','Abcv','Defg']
pop_data

             2001  2002  2003  2004  2005  2006  2007  2008  2009  2010
india          91    92    93    94    95    96    97    98    89    54
America       120   125   130   135   140   145   150   155   160   165
Rashya         91    92    93    94    95    96    97    98    89    54
Canada        120   125   130   135   140   145   150   155   160   165
italy         120   125   130   135   140   145   150   155   160   165
china          91    92    93    94    95    96    97    98    89    54
Africa        120   125   130   135   140   145   150   155   160   165
Afganisthan    91    92    93    94    95    96    97    98    89    54
Usa           120   125   130   135   140   145   150   155   160   165
Dubai         120   125   130   135   140   145   150   155   160   165
Abcv           91    92    93    94    95    96    97    98    89    54
Defg          120   125   130   135   140   145   150   155   160   165

In [ ]:
marks=pd.